# A Super Short Intro to Pandas

Pandas is a high level data manipulation tool in Python, that is extremely helpful while working with tabular data.

### Dataframes and Series

- A Pandas Dataframe is used for storing Two Dimensional Tabular data, that can contain Heterogeneous data types.
- A Pandas Dataframe is made up of Pandas Series.

In [1]:
# Import Pandas and other libraries

import pandas as pd
import numpy as np

In [2]:
# Create a Pandas Series, with a NaN value

s = pd.Series([1,2,3,4,5,6,np.nan,8,9,10])
print(s)

0     1.0
1     2.0
2     3.0
3     4.0
4     5.0
5     6.0
6     NaN
7     8.0
8     9.0
9    10.0
dtype: float64

In [3]:
# Create a Pandas Series, containing dates from March 01, 2020 to March 10, 2020
d = pd.date_range('20200301', periods = 10)
print(d)

DatetimeIndex(['2020-03-01', '2020-03-02', '2020-03-03', '2020-03-04',
               '2020-03-05', '2020-03-06', '2020-03-07', '2020-03-08',
               '2020-03-09', '2020-03-10'],
              dtype='datetime64[ns]', freq='D')

In [4]:
# Creating a Pandas DataFrame of random numbers, wuth dates as index for each row..

df = pd.DataFrame(np.random.randn(10,4),index = d, columns = ['A', 'B', 'C', 'D'])
print(df)

                   A         B         C         D
2020-03-01 -0.146292  0.323949  1.882928  1.242088
2020-03-02  0.475268  0.202893  0.076442 -0.363540
2020-03-03 -0.477466  0.887936 -0.271738 -0.579712
2020-03-04  0.057061  0.620911  1.200638 -1.305464
2020-03-05 -0.631735  0.979100 -1.414676  0.819946
2020-03-06 -0.645971 -0.413545 -0.309198 -0.517066
2020-03-07  0.422937  1.292645  0.102068 -0.381063
2020-03-08 -2.922119 -0.490739 -2.058871  0.762872
2020-03-09 -1.417187  0.525924  0.444228 -0.428087
2020-03-10 -0.824650 -1.546095  0.375018  1.212360

In [5]:
# Create Pandas dataframe with heterogeneous data, from a Python dictionary

df1 = pd.DataFrame({'A': [1,2,3,4], 
                   'B': pd.Timestamp('20200301'),
                    'C': pd.Series(1,index = list(range(4)),dtype = 'float32'), 
                   'D': np.array([5]*4, dtype='int32'), 
                   'E': pd.Categorical(['True', 'False', 'True', 'False']), 
                   'F': 'GUIST'})

In [6]:
# Now let's check the dataframe that we created..

print(df1)
print(df1.dtypes)

   A          B    C  D      E      F
0  1 2020-03-01  1.0  5   True  GUIST
1  2 2020-03-01  1.0  5  False  GUIST
2  3 2020-03-01  1.0  5   True  GUIST
3  4 2020-03-01  1.0  5  False  GUIST
A             int64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [9]:
# Checking the first 5 values of the dataframe
df.head()

                   A         B         C         D
2020-03-01 -0.146292  0.323949  1.882928  1.242088
2020-03-02  0.475268  0.202893  0.076442 -0.363540
2020-03-03 -0.477466  0.887936 -0.271738 -0.579712
2020-03-04  0.057061  0.620911  1.200638 -1.305464
2020-03-05 -0.631735  0.979100 -1.414676  0.819946

In [10]:
# Checking the last 5 values of the dataframe
df.tail()

                   A         B         C         D
2020-03-06 -0.645971 -0.413545 -0.309198 -0.517066
2020-03-07  0.422937  1.292645  0.102068 -0.381063
2020-03-08 -2.922119 -0.490739 -2.058871  0.762872
2020-03-09 -1.417187  0.525924  0.444228 -0.428087
2020-03-10 -0.824650 -1.546095  0.375018  1.212360

In [11]:
# Check the indices of your dataframe.. 

df.index

DatetimeIndex(['2020-03-01', '2020-03-02', '2020-03-03', '2020-03-04',
               '2020-03-05', '2020-03-06', '2020-03-07', '2020-03-08',
               '2020-03-09', '2020-03-10'],
              dtype='datetime64[ns]', freq='D')

In [13]:
# Check the Columns of a dataframe

df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [14]:
# Get the dataframe data in the Numpy array format

df.to_numpy()

array([[-0.14629229,  0.32394921,  1.88292769,  1.24208824],
       [ 0.475268  ,  0.20289313,  0.07644237, -0.36353987],
       [-0.47746627,  0.88793616, -0.27173769, -0.57971238],
       [ 0.05706111,  0.62091083,  1.20063837, -1.30546444],
       [-0.63173519,  0.97909987, -1.41467649,  0.8199464 ],
       [-0.64597148, -0.41354457, -0.30919831, -0.51706583],
       [ 0.42293733,  1.29264523,  0.10206755, -0.38106268],
       [-2.92211905, -0.49073906, -2.05887089,  0.76287172],
       [-1.41718743,  0.52592398,  0.44422812, -0.42808718],
       [-0.82465006, -1.54609529,  0.3750176 ,  1.21236021]])

In [15]:
# Get some statistics of your data inside the dataframe

df.describe()

               A          B          C          D
count  10.000000  10.000000  10.000000  10.000000
mean   -0.611016   0.238298   0.002684   0.046233
std     0.998199   0.847259   1.142649   0.882786
min    -2.922119  -1.546095  -2.058871  -1.305464
25%    -0.779980  -0.259435  -0.299833  -0.494821
50%    -0.554601   0.424937   0.089255  -0.372301
75%     0.006223   0.821180   0.426925   0.805678
max     0.475268   1.292645   1.882928   1.242088

In [19]:
# Sorting by index

df.sort_index(ascending = False)

                   A         B         C         D
2020-03-10 -0.824650 -1.546095  0.375018  1.212360
2020-03-09 -1.417187  0.525924  0.444228 -0.428087
2020-03-08 -2.922119 -0.490739 -2.058871  0.762872
2020-03-07  0.422937  1.292645  0.102068 -0.381063
2020-03-06 -0.645971 -0.413545 -0.309198 -0.517066
2020-03-05 -0.631735  0.979100 -1.414676  0.819946
2020-03-04  0.057061  0.620911  1.200638 -1.305464
2020-03-03 -0.477466  0.887936 -0.271738 -0.579712
2020-03-02  0.475268  0.202893  0.076442 -0.363540
2020-03-01 -0.146292  0.323949  1.882928  1.242088

In [20]:
# Sorting by values

df.sort_values(by = 'C')

                   A         B         C         D
2020-03-08 -2.922119 -0.490739 -2.058871  0.762872
2020-03-05 -0.631735  0.979100 -1.414676  0.819946
2020-03-06 -0.645971 -0.413545 -0.309198 -0.517066
2020-03-03 -0.477466  0.887936 -0.271738 -0.579712
2020-03-02  0.475268  0.202893  0.076442 -0.363540
2020-03-07  0.422937  1.292645  0.102068 -0.381063
2020-03-10 -0.824650 -1.546095  0.375018  1.212360
2020-03-09 -1.417187  0.525924  0.444228 -0.428087
2020-03-04  0.057061  0.620911  1.200638 -1.305464
2020-03-01 -0.146292  0.323949  1.882928  1.242088

In [21]:
# Getting all data regarding a single columns

df['C']

2020-03-01    1.882928
2020-03-02    0.076442
2020-03-03   -0.271738
2020-03-04    1.200638
2020-03-05   -1.414676
2020-03-06   -0.309198
2020-03-07    0.102068
2020-03-08   -2.058871
2020-03-09    0.444228
2020-03-10    0.375018
Freq: D, Name: C, dtype: float64

In [22]:
# Slicing

df[0:3]

                   A         B         C         D
2020-03-01 -0.146292  0.323949  1.882928  1.242088
2020-03-02  0.475268  0.202893  0.076442 -0.363540
2020-03-03 -0.477466  0.887936 -0.271738 -0.579712

In [23]:
# Getting data by label

df.loc[d[0]]

A   -0.146292
B    0.323949
C    1.882928
D    1.242088
Name: 2020-03-01 00:00:00, dtype: float64

In [25]:
# Get multiple columns

df.loc[:,['A', 'C']]

                   A         C
2020-03-01 -0.146292  1.882928
2020-03-02  0.475268  0.076442
2020-03-03 -0.477466 -0.271738
2020-03-04  0.057061  1.200638
2020-03-05 -0.631735 -1.414676
2020-03-06 -0.645971 -0.309198
2020-03-07  0.422937  0.102068
2020-03-08 -2.922119 -2.058871
2020-03-09 -1.417187  0.444228
2020-03-10 -0.824650  0.375018

In [26]:
# More ways to print subset of your data

df.loc['20200301':'20200306', ['D', 'C']]

                   D         C
2020-03-01  1.242088  1.882928
2020-03-02 -0.363540  0.076442
2020-03-03 -0.579712 -0.271738
2020-03-04 -1.305464  1.200638
2020-03-05  0.819946 -1.414676
2020-03-06 -0.517066 -0.309198

In [27]:
# Getting individual values

df.at['20200301','C']

1.8829276904059282

In [29]:
# Getting data using indices

# df.iloc[3]
df.iloc[3][0]

0.05706111071686716

In [30]:
# Boolean indexing

df[df['A'] > 0]

                   A         B         C         D
2020-03-02  0.475268  0.202893  0.076442 -0.363540
2020-03-04  0.057061  0.620911  1.200638 -1.305464
2020-03-07  0.422937  1.292645  0.102068 -0.381063

#### Handling missing data!!

In [33]:
# Create a Dataframe with NaN values

df2 = df.reindex(index = d[0:4], columns = list(df.columns)+['E'])
df2.loc[d[0]:d[1], 'E'] = 1

In [34]:
df2

                   A         B         C         D    E
2020-03-01 -0.146292  0.323949  1.882928  1.242088  1.0
2020-03-02  0.475268  0.202893  0.076442 -0.363540  1.0
2020-03-03 -0.477466  0.887936 -0.271738 -0.579712  NaN
2020-03-04  0.057061  0.620911  1.200638 -1.305464  NaN

In [41]:
# Find out where NaN values are present

df2.isna()

                A      B      C      D      E
2020-03-01  False  False  False  False  False
2020-03-02  False  False  False  False  False
2020-03-03  False  False  False  False   True
2020-03-04  False  False  False  False   True

In [42]:
# Find the column wise count of NaN values

df2.isna().sum()

A    0
B    0
C    0
D    0
E    2
dtype: int64

In [43]:
# Drop the rows with NaN values

df2.dropna()

                   A         B         C         D    E
2020-03-01 -0.146292  0.323949  1.882928  1.242088  1.0
2020-03-02  0.475268  0.202893  0.076442 -0.363540  1.0

In [44]:
df2

                   A         B         C         D    E
2020-03-01 -0.146292  0.323949  1.882928  1.242088  1.0
2020-03-02  0.475268  0.202893  0.076442 -0.363540  1.0
2020-03-03 -0.477466  0.887936 -0.271738 -0.579712  NaN
2020-03-04  0.057061  0.620911  1.200638 -1.305464  NaN

In [45]:
# Next we are going to try to fill the missing values

df2.fillna(value = 2)

                   A         B         C         D    E
2020-03-01 -0.146292  0.323949  1.882928  1.242088  1.0
2020-03-02  0.475268  0.202893  0.076442 -0.363540  1.0
2020-03-03 -0.477466  0.887936 -0.271738 -0.579712  2.0
2020-03-04  0.057061  0.620911  1.200638 -1.305464  2.0

#### Pandas Operations

In [46]:
df.mean()

A   -0.611016
B    0.238298
C    0.002684
D    0.046233
dtype: float64

In [48]:
df.apply(lambda x: x.max() - x.min())

A    3.397387
B    2.838741
C    3.941799
D    2.547553
dtype: float64

In [51]:
s = pd.Series(['GUIST', 'Python', 'Jupyter', np.nan, 'Football','World'])
s.str.upper()

0       GUIST
1      PYTHON
2     JUPYTER
3         NaN
4    FOOTBALL
5       WORLD
dtype: object

#### Concatenate Dataframes

In [52]:
df = pd.DataFrame(np.random.randn(10,4))
df

          0         1         2         3
0 -0.110448 -0.354062 -0.310829 -1.555671
1 -0.674877  1.048064  1.178493 -1.269769
2 -0.379364  0.764829 -0.227512 -0.657047
3 -0.650801 -1.792464 -0.904626  0.656273
4 -0.040711 -1.237936  1.192487  1.710018
5  1.428204 -0.291589  1.338573  0.778127
6 -1.477740 -0.478519 -0.026250 -1.039459
7  1.940841  0.860750  0.037533 -0.097209
8  1.665129 -0.182415 -0.385203  0.662129
9  0.831367  0.398380  1.151593 -1.626961

In [54]:
df2 = [df[:3], df[3:7], df[7:]]
df2

[          0         1         2         3
 0 -0.110448 -0.354062 -0.310829 -1.555671
 1 -0.674877  1.048064  1.178493 -1.269769
 2 -0.379364  0.764829 -0.227512 -0.657047,
           0         1         2         3
 3 -0.650801 -1.792464 -0.904626  0.656273
 4 -0.040711 -1.237936  1.192487  1.710018
 5  1.428204 -0.291589  1.338573  0.778127
 6 -1.477740 -0.478519 -0.026250 -1.039459,
           0         1         2         3
 7  1.940841  0.860750  0.037533 -0.097209
 8  1.665129 -0.182415 -0.385203  0.662129
 9  0.831367  0.398380  1.151593 -1.626961]

In [56]:
pd.concat(df2)

          0         1         2         3
0 -0.110448 -0.354062 -0.310829 -1.555671
1 -0.674877  1.048064  1.178493 -1.269769
2 -0.379364  0.764829 -0.227512 -0.657047
3 -0.650801 -1.792464 -0.904626  0.656273
4 -0.040711 -1.237936  1.192487  1.710018
5  1.428204 -0.291589  1.338573  0.778127
6 -1.477740 -0.478519 -0.026250 -1.039459
7  1.940841  0.860750  0.037533 -0.097209
8  1.665129 -0.182415 -0.385203  0.662129
9  0.831367  0.398380  1.151593 -1.626961

In [67]:
left = pd.DataFrame({'A': [1,2,2,1,1,2], 'B': [3,4,5,6,7,8]})
right = pd.DataFrame({'C': [2,2,2,2,2,2], 'D': [4,4,4,4,4,4]})

In [68]:
left

   A  B
0  1  3
1  2  4
2  2  5
3  1  6
4  1  7
5  2  8

In [69]:
right

   C  D
0  2  4
1  2  4
2  2  4
3  2  4
4  2  4
5  2  4

In [70]:
df3 = pd.concat([left,right], axis = 1)
df3

   A  B  C  D
0  1  3  2  4
1  2  4  2  4
2  2  5  2  4
3  1  6  2  4
4  1  7  2  4
5  2  8  2  4

#### Group by on columns

In [71]:
# Group by

df3.groupby('A').sum()

    B  C   D
A
1  16  6  12
2  17  6  12